app/Http/Controllers/CashoutsController.php

    public function get_all_cashouts(Request $request) {

        try {
            if ($request->ajax()) {

                $token = csrf_token();
                $inside_form = $request->inside_form;
                $type = $request->type;
                $status = $request->status;

                $all_datas = Cashout::select('cashouts.*','respondents.name','respondents.email','respondents.mobile')
                    ->join('respondents', 'respondents.id', '=', 'cashouts.respondent_id');
                    if(isset($request->id)){
                        if($inside_form == 'respondents'){
                            $all_datas->where('cashouts.respondent_id',$request->id);
                        }
                    }

                    if($type != null){
                        $all_datas->where('cashouts.type_id',$type);
                    }

                    if($status != null){
                        $all_datas->where('cashouts.status_id',$status);
                    }

                $all_datas = $all_datas->orderby("id","desc")->withoutTrashed()->get();
---
select `cashouts`.*, `respondents`.`name`, `respondents`.`email`, `respondents`.`mobile` from `cashouts` inner join `respondents` on `respondents`.`id` = `cashouts`.`respondent_id` order by `id` desc