app/Http/Controllers/CustomAuthController.php

    public function dashboard()
    {
        try {
            if (Auth::check()) {

                $active_val = DB::table('respondents')
                ->where("active_status_id",1)
                ->count();

                $deactive_val = DB::table('respondents')
                ->where("active_status_id",2)
                ->count();

                $unsub_val = DB::table('respondents')
                ->where("active_status_id",3)
                ->count();

                $pending_val = DB::table('respondents')
                ->where("active_status_id",5)
                ->count();

                $black_val = DB::table('respondents')
                ->where("active_status_id",5)
                ->count();
---
select count(*) as aggregate from `respondents` where `active_status_id` = 1
select count(*) as aggregate from `respondents` where `active_status_id` = 2
select count(*) as aggregate from `respondents` where `active_status_id` = 3
select count(*) as aggregate from `respondents` where `active_status_id` = 5