app/Http/Controllers/SurveyController.php

select * from `survey` order by `id` desc
---
    public function storeFolder(Request $request){
        $user = Auth::guard('admin')->user();
        $folder=new Folder();
        $folder->folder_name=$request->folder_name;
        $folder->folder_type=$request->folder_type;
        $folder->survery_count=0;
        $folder->created_by=$user->id;
        if($request->folder_type=='private'){
            $folder->user_ids=implode(',', $request->privateusers);
        }
        $folder->save();
        return redirect()->route('survey.template',$folder->id)->with('success', __('Folder Created Successfully.'));

select * from `survey` where (`id` = '21') limit 1
---
    public function editSurvey($id){

        $survey=Survey::where(['id'=>$id])->first();