app/Http/Controllers/TagsController.php

select * from `tags` order by `created_at` desc
---
    public function get_all_tags(Request $request) {

        try {
            if ($request->ajax()) {

                $token = csrf_token();


                $all_datas =Tags::latest()
                ->get();