app/Http/Controllers/UsersController.php

select `respondents`.* from `respondents` order by `respondents`.`id` desc
---
        $sheet->setCellValue('T1', 'Referred by Email');


        $all_datas = Respondents::select('respondents.*')
        ->orderby("respondents.id","desc")
        ->limit(10)
        ->get();