app/Http/Controllers/UsersController.php

select * from `users` where `status_id` = 1 and `users`.`deleted_at` is null
---
    public function index()
    {
        try {

            $users=Users::where('status_id',1)->get();

select * from `users` where `status_id` = '1' order by `id` desc
---
    public function get_all_users(Request $request) {

        try {
            if ($request->ajax()) {

                $token = csrf_token();
                $role = $request->role;
                $status = $request->status;

                $all_datas = Users::withoutTrashed();
                if($role != null){
                    $all_datas->where('users.role_id',$role);
                }

                if($status != null){
                    $all_datas->where('users.status_id',$status);
                }
                $all_datas=$all_datas->latest()->get();